[
  {
    "id": 1,
    "gallery": [
      "/assets/img/Error.jpeg",
      "/assets/img/Screenshot from 2024-07-30 18-50-09.png",
      "/assets/img/Server Logs.png"
    ],
    "title": "WHM Internal Server Error Debugging and Troubleshooting + Laravel Project Upgrade",
    "description": "<div class=\"mt-4\">\n  <!-- Description Section -->\n  <div class=\"mb-4\">\n    <h3>Description:</h3>\n    <p>\n      The client’s web application was down due to an internal server error caused by upgrading PHP from version 8.2 to 8.3. This upgrade led to a wide range of server issues. I addressed and resolved numerous technical challenges involving PHP environment setup, server configurations, and application dependencies. This process required extensive troubleshooting and optimization to ensure seamless and reliable application performance.\n    </p>\n  </div>\n\n  <!-- Responsibilities Section -->\n  <div class=\"mb-4\">\n    <h3>Responsibilities:</h3>\n\n    <!-- PHP Version Issues -->\n    <div class=\"mb-3\">\n      <h5>PHP Version Issues:</h5>\n      <ul>\n        <li>Fixed PHP version discrepancies by ensuring compatibility between different PHP versions used by the server and PHP-FPM.</li>\n        <li>Configured the PHP version for the site, ensuring the correct version was utilized by both the web server and PHP-FPM.</li>\n      </ul>\n    </div>\n\n    <!-- PHP-FPM Service Issues -->\n    <div class=\"mb-3\">\n      <h5>PHP-FPM Service Issues:</h5>\n      <ul>\n        <li>Diagnosed and resolved PHP-FPM service errors, including fixing the issue where PHP-FPM was not restarting correctly.</li>\n        <li>Checked PHP-FPM configurations and ensured the correct socket directories were set up.</li>\n        <li>Verified the systemctl status and restarted PHP-FPM for specific cPanel accounts to ensure smooth operation.</li>\n      </ul>\n    </div>\n\n    <!-- Permission Issues -->\n    <div class=\"mb-3\">\n      <h5>Permission Issues:</h5>\n      <ul>\n        <li>Addressed file and directory permission issues that were causing \"Forbidden\" (403) errors.</li>\n        <li>Ensured the .htaccess file and directories were readable and executable.</li>\n        <li>Configured the .htaccess file and web server settings to resolve permission-related errors.</li>\n      </ul>\n    </div>\n\n    <!-- Server Configuration -->\n    <div class=\"mb-3\">\n      <h5>Server Configuration:</h5>\n      <ul>\n        <li>Adjusted web server configurations to ensure proper handling of requests and to avoid \"Internal Server Error\" (500) and \"Service Unavailable\" (503) errors.</li>\n        <li>Configured ModSecurity rules, firewall, and security settings to prevent unauthorized access while allowing necessary operations.</li>\n      </ul>\n    </div>\n\n    <!-- Composer Dependency Issues -->\n    <div class=\"mb-3\">\n      <h5>Composer Dependency Issues:</h5>\n      <ul>\n        <li>Managed and resolved Composer dependency conflicts by installing and configuring required packages and extensions.</li>\n        <li>Ensured all necessary PHP extensions such as iconv, mbstring, zip, curl, sodium, fileinfo, bcmath, and gd were enabled and correctly configured.</li>\n      </ul>\n    </div>\n\n    <!-- Laravel Upgrade -->\n    <div class=\"mb-3\">\n      <h5>Laravel Upgrade:</h5>\n      <ul>\n        <li>Upgraded Laravel to use PHP 8.3, ensuring compatibility and improved performance.</li>\n        <li>Performed thorough testing and debugging to ensure the application ran smoothly on the upgraded environment.</li>\n      </ul>\n    </div>\n\n    <!-- Error Resolution -->\n    <div class=\"mb-3\">\n      <h5>Error Resolution:</h5>\n      <ul>\n        <li>Fixed various HTTP errors including 403 (Forbidden) and 503 (Service Unavailable).</li>\n        <li>Diagnosed and resolved internal server errors (500), ensuring proper server configuration and application functionality.</li>\n      </ul>\n    </div>\n  </div>\n</div>",
    "technologies": [
      "PHP",
      "Apache",
      "Composer",
      "Laravel"
    ],
    "deliverables": [
      "Server Administration",
      "Full Stack Develompent",
      "Web Server Configuration and Optimization",
      "Application Upgrades and Migration",
      "Server Security",
      "Website"
    ],
    "startDate": "2024-07-10",
    "endDate": "2024-07-30",
    "link": "https://blengi.com",
    "isUp": true
  },
  {
    "id": 2,
    "gallery": [
      "/assets/img/6c87de9f-464f-4e85-a1f9-b10bef03b296.jpeg",
      "/assets/img/690fcbb5-c49c-4a50-88bb-d8bb07566ff3.jpeg",
      "/assets/img/a50baf44-d55d-4830-b2d2-84074a02d057.jpeg"
    ],
    "title": "Debugging and Troubleshooting 503 Downtime Issues in WordPress",
    "description": "<div class=\"container mt-5\">\n    <p><strong>Description</strong></p>\n    <p>\n        Addressed and resolved persistent 503 Service Unavailable errors affecting a WordPress site, ensuring improved uptime and reliability. Conducted thorough debugging to identify the root causes of downtime, including server overload, plugin conflicts, and cron job issues. Implemented effective troubleshooting strategies to optimize server performance and mitigate future downtime.\n    </p>\n\n    <p><strong>Responsibilities</strong></p>\n    <ul>\n        <li><strong>Issue Diagnosis:</strong> Conducted in-depth analysis to identify the causes of 503 errors, including server load, plugin conflicts, and misconfigurations.</li>\n        <li><strong>Troubleshooting Plan:</strong> Developed and executed a comprehensive troubleshooting plan to address and resolve identified issues.</li>\n        <li><strong>Server Optimization:</strong> Implemented server and resource optimizations to handle high traffic and prevent future downtime.</li>\n        <li><strong>Plugin and Theme Review:</strong> Analyzed and updated plugins and themes to ensure compatibility and performance.</li>\n        <li><strong>Error Log Analysis:</strong> Reviewed and interpreted server and error logs to pinpoint issues and verify fixes.</li>\n        <li><strong>Monitoring Setup:</strong> Configured and fine-tuned monitoring tools to track site health and receive timely alerts for potential issues.</li>\n        <li><strong>Performance Improvements:</strong> Enhanced overall site performance through caching, database optimization, and server configuration.</li>\n    </ul>\n    \n</div>",
    "technologies": [
      "PHP",
      "Wordpress",
      "UptimeRobot",
      "Apache"
    ],
    "deliverables": [
      "Server Administration",
      "Full Stack Develompent",
      "Website",
      "CMS"
    ],
    "startDate": "2024-07-01",
    "endDate": "2024-07-06",
    "link": "https://xpfrance.net",
    "isUp": true
  },
  {
    "id": 3,
    "gallery": [
      "/assets/img/776d17c3-3a53-48d3-a3bf-59603faf668a.jpeg",
      "/assets/img/2a90fb3e-35c7-45e5-b97e-55bd06a8b90f.jpeg",
      "/assets/img/aa0d3223-935e-4047-8fed-d204e0667ce0.jpeg"
    ],
    "title": "Debugging and Troubleshooting Stripe Payment Issues in WordPress Tour Master Plugin",
    "description": "<div class=\"mt-5\">\n  <p><strong>Description:</strong></p>\n  <p>Resolved critical payment issues within the WordPress Tour Master Plugin involving Stripe credit card transactions. The problem was identified during the booking process for tours, where several PHP notices and fatal errors were logged, indicating issues with undefined indices and type errors in Stripe API integration.</p>\n\n  <p><strong>Responsibilities:</strong></p>\n  <ul>\n    <li>Analyzed and identified the root cause of the payment processing errors in the WordPress Tour Master Plugin.</li>\n    <li>Diagnosed PHP notices related to undefined indices for <code>tour-date</code> and <code>tour-dinner-option</code> and resolved them.</li>\n    <li>Addressed fatal errors linked to the Stripe API, including type mismatches and incorrect handling of API responses.</li>\n    <li>Debugged and corrected issues in the plugin's Stripe integration code, focusing on proper data handling and API request formatting.</li>\n    <li>Tested and verified the solution to ensure successful completion of tour bookings with Stripe payments.</li>\n    <li>Provided recommendations for future improvements to prevent similar issues.</li>\n  </ul>\n\n  <p><strong>Technical Details:</strong></p>\n  <ul>\n    <li><strong>Errors Encountered:</strong> Undefined index warnings, <code>TypeError</code> in Stripe API calls.</li>\n    <li><strong>Error Logs:</strong> Detailed log entries indicated problems with <code>tour-date</code>, <code>tour-dinner-option</code>, and <code>Stripe\\Util\\CaseInsensitiveArray::offsetGet()</code>.</li>\n  </ul>\n</div>\n",
    "technologies": [
      "PHP",
      "Apache",
      "Wordpress",
      "Stripe"
    ],
    "deliverables": [
      "Full Stack Develompent",
      "Website",
      "API",
      "API Integration",
      "Wordpress Plugin Development",
      "Plugin Development",
      "CMS"
    ],
    "startDate": "2024-07-01",
    "endDate": "2024-07-11",
    "link": "https://vagabondmoto.com.au",
    "isUp": true
  },
  {
    "id": 4,
    "gallery": [
      "/assets/img/cropped.jpeg",
      "/assets/img/Screenshot from 2024-07-31 10-00-27.png",
      "/assets/img/Screenshot from 2024-07-31 09-58-54.png",
      "/assets/img/Screenshot from 2024-07-31 09-58-08.png",
      "/assets/img/WhatsApp Image 2024-07-05 at 11.31.43 AM.jpeg",
      "/assets/img/WhatsApp Image 2024-07-08 at 1.38.04 PM.jpeg",
      "/assets/img/3ebcc87b-665c-49ea-989f-2dcc6c25945a.jpeg",
      "/assets/img/9b079e64-8cf1-4152-be88-ec0cf7e06429.jpeg"
    ],
    "title": "WordPress User Authentication Plugin Development with PayPal Payment and Subscription Integration",
    "description": "<div class=\"container mt-5\">\n  <p><strong>Description:</strong></p>\n  <p>Developed a comprehensive WordPress plugin to manage user authentication, PayPal payments, and subscription integrations. The plugin was designed to display user-specific data upon login, enable admin data management via the WordPress dashboard, and provide secure access to personal fitness scores and training programs.</p>\n\n  <p><strong>Responsibilities:</strong></p>\n  <ul>\n    <li>Collaborated with the client to gather and understand requirements for user-specific data display and secure access.</li>\n    <li>Developed custom user authentication features to display specific data upon login.</li>\n    <li>Implemented an admin interface for managing user data, including fitness scores, via the WordPress dashboard.</li>\n    <li>Integrated PayPal payment processing to facilitate the purchase of online fitness training programs.</li>\n    <li>Created user profile pages with tabs for personal information, medical information, and subscriptions.</li>\n    <li>Ensured data privacy and security, particularly for sensitive medical information.</li>\n    <li>Provided functionality for users to edit their profile information and for admins to update medical information.</li>\n    <li>Implemented a feature allowing bulk upload of user fitness scores through Excel.</li>\n    <li>Added a PDF management feature, allowing admins to upload and manage PDFs for each user.</li>\n  </ul>\n\n  <p><strong>Technical Details:</strong></p>\n  <ul>\n    <li><strong>Technologies Used:</strong> WordPress, PHP, WooCommerce, PayPal API</li>\n    <li><strong>Key Features:</strong> User-specific data display, PayPal payment integration, admin data management, secure user authentication, profile and subscription management, PDF management for users</li>\n  </ul>\n</div>",
    "technologies": [
      "PHP",
      "Apache",
      "Wordpress",
      "MySQL",
      "CSS",
      "HTML",
      "Woo commerce",
      "PayPal"
    ],
    "deliverables": [
      "Website",
      "API",
      "CMS",
      "Plugin",
      "Plugin Development",
      "Wordpress Plugin Development",
      "API Integration",
      "E-commerce",
      "Full Stack Develompent"
    ],
    "startDate": "2024-06-11",
    "endDate": "2024-06-30",
    "link": "https://performancewip.com",
    "isUp": true
  },
  {
    "id": 5,
    "title": "Custom WordPress Map Plugin Development with Leaflet and OpenStreetMap Integration",
    "description": "<div class=\"container mt-5\">\n  <p><strong>Description:</strong></p>\n  <p>Developed a custom WordPress plugin to create map features similar to those on a non-WordPress website. The plugin utilized Leaflet Library and OpenStreetMap API, along with Vue.js, to provide a cost-effective solution while meeting client requirements for displaying dispensary locations.</p>\n\n  <p><strong>Responsibilities:</strong></p>\n  <ul>\n    <li>Analyzed the client’s requirements to replicate map features from a non-WordPress website using open-source tools.</li>\n    <li>Developed a custom WordPress plugin using Leaflet Library and OpenStreetMap API for map integration.</li>\n    <li>Incorporated Vue.js to enhance the plugin’s functionality and user experience.</li>\n    <li>Designed and implemented algorithms for dispensary search with various locations and geocoding capabilities.</li>\n    <li>Loaded 306 dispensary locations dynamically using Vue.js and JavaScript, avoiding the need to create individual pages.</li>\n    <li>Designed and styled the user interface with CSS and HTML to ensure a seamless and aesthetically pleasing user experience.</li>\n    <li>Ensured the plugin provided a seamless user experience, similar to the reference site using Google Maps API, but at a lower cost.</li>\n    <li>Integrated geocoding and search functionalities to enhance user experience and accessibility.</li>\n    <li>Utilized ingenuity to overcome challenges related to the differences between WordPress and the powerful framework used by the reference site.</li>\n  </ul>\n\n  <p><strong>Technical Details:</strong></p>\n  <ul>\n    <li><strong>Technologies Used:</strong> WordPress, Leaflet Library, OpenStreetMap API, Vue.js, CSS, HTML</li>\n    <li><strong>Key Features:</strong> Custom map integration, dispensary search algorithms, geocoding, Vue.js enhancement, dynamic loading of locations, user interface design and styling, cost-effective solution</li>\n  </ul>\n</div>\n",
    "startDate": "2024-06-06",
    "endDate": "2024-06-20",
    "technologies": [
      "PHP",
      "Vue.js",
      "Wordpress",
      "Apache",
      "HTML",
      "CSS",
      "Leaflet Library",
      "OpenStreet Map API"
    ],
    "deliverables": [
      "Full Stack Develompent",
      "Website",
      "Wordpress Plugin Development",
      "Plugin Development",
      "API Integration",
      "Plugin",
      "CMS",
      "API"
    ],
    "gallery": [
      "/assets/img/Screenshot from 2024-07-31 11-40-46.png",
      "/assets/img/Screenshot from 2024-07-31 11-41-16.png",
      "/assets/img/Screenshot from 2024-07-31 11-41-40.png",
      "/assets/img/WhatsApp Image 2024-05-04 at 12.02.00 PM.jpeg"
    ],
    "link": "https://theluxeharmony.com",
    "isUp": true
  },
  {
    "id": 6,
    "gallery": [
      "/assets/img/Screenshot from 2024-08-01 09-27-55.png",
      "/assets/img/Screenshot from 2024-08-01 09-28-17.png",
      "/assets/img/Screenshot from 2024-08-01 09-28-37.png",
      "/assets/img/Screenshot from 2024-08-01 09-28-58.png"
    ],
    "title": "Laravel + Vuejs Development of Escort Models Membership Platform",
    "description": "<div class=\"container mt-5\">\n <p><strong>Description:</strong></p>\n  <p>Developed a comprehensive membership platform for escort models using Vue.js and Laravel. The platform allows administrators to add images and details for each model, enabling interested clients to view profiles and contact the models directly.</p>\n\n  <p><strong>Responsibilities:</strong></p>\n  <ul>\n    <li>Designed and implemented the membership platform using Vue.js for the front end and Laravel for the back end.</li>\n    <li>Created an intuitive admin panel for adding and managing models' profiles, including images and detailed descriptions.</li>\n    <li>Developed user-friendly interfaces for clients to browse and search for models based on various criteria.</li>\n    <li>Implemented secure contact mechanisms for clients to reach out to models.</li>\n    <li>Ensured the platform is responsive and provides a seamless user experience across devices.</li>\n  </ul>\n\n  <p><strong>Technical Details:</strong></p>\n  <ul>\n    <li><strong>Technologies Used:</strong> Vue.js, Laravel</li>\n    <li><strong>Key Features:</strong> Admin panel for model management, profile viewing, client-model contact functionality, responsive design</li>\n  </ul>\n</div>\n",
    "technologies": [
      "PHP",
      "Apache",
      "Vue.js",
      "Composer",
      "Node.js",
      "Laravel",
      "MySQL",
      "Bootstrap",
      "HTML",
      "CSS"
    ],
    "deliverables": [
      "Full Stack Develompent",
      "Server Security",
      "Website",
      "API",
      "CMS",
      "Single Page Application",
      "Progressive Web App"
    ],
    "startDate": "2024-06-01",
    "endDate": "2024-08-17",
    "link": "http://localhost:5173/"
  },
  {
    "id": 8,
    "gallery": [
      "/assets/img/Screenshot from 2024-08-01 11-35-27.png",
      "/assets/img/Screenshot from 2024-08-01 11-35-03.png"
    ],
    "title": "Hacked WordPress Site Restoration, Penetration Testing and Security Enhancement",
    "description": "<div class=\"container mt-5\">\n  <p><strong>Description:</strong></p>\n  <p>Restored and secured a client's website after it was attacked and severely compromised by hackers. Conducted comprehensive debugging and troubleshooting, followed by penetration testing using advanced tools to ensure robust security.</p>\n\n  <p><strong>Responsibilities:</strong></p>\n  <ul>\n    <li>Restored the website from backups and reconstructed lost data.</li>\n    <li>Debugged and troubleshooted issues caused by the hacking incident.</li>\n    <li>Performed extensive penetration testing to identify and fix security vulnerabilities.</li>\n    <li>Utilized tools such as Burp Suite, SQLMap, Kali Linux, WPScan, and OWASP ZAP for thorough security analysis.</li>\n    <li>Implemented security enhancements to prevent future attacks and ensure the website's integrity.</li>\n  </ul>\n\n  <p><strong>Technical Details:</strong></p>\n  <ul>\n    <li><strong>Technologies Used:</strong> WordPress, Burp Suite, SQLMap, Kali Linux, WPScan, OWASP ZAP</li>\n    <li><strong>Key Features:</strong> Website restoration, debugging and troubleshooting, penetration testing, security enhancements</li>\n  </ul>\n</div>\n",
    "technologies": [
      "PHP",
      "Apache",
      "Wordpress",
      "OWASP ZAP",
      "WPScan",
      "Kali Linux",
      "sql-map",
      "Burp-suite",
      "HTML",
      "CSS",
      "Bootstrap",
      "MySQL"
    ],
    "deliverables": [
      "Server Administration",
      "Full Stack Develompent",
      "Web Server Configuration and Optimization",
      "API",
      "CMS",
      "Website"
    ],
    "startDate": "2024-06-01",
    "endDate": "2024-06-14",
    "link": "https://plurfilm.com/",
    "isUp": true
  },
  {
    "id": 9,
    "gallery": [
      "/assets/img/Screenshot from 2024-08-01 11-45-44.png ",
      "/assets/img/Screenshot from 2024-08-01 11-46-00.png"
    ],
    "title": "Hacked WordPress Site Restoration, Penetration Testing and Security Enhancement",
    "description": "<div class=\"container mt-5\">\n  <p><strong>Description:</strong></p>\n  <p>Restored and secured a client's website after it was attacked and severely compromised by hackers. Conducted comprehensive debugging and troubleshooting, followed by penetration testing using advanced tools to ensure robust security.</p>\n\n  <p><strong>Responsibilities:</strong></p>\n  <ul>\n    <li>Restored the website from backups and reconstructed lost data.</li>\n    <li>Debugged and troubleshooted issues caused by the hacking incident.</li>\n    <li>Performed extensive penetration testing to identify and fix security vulnerabilities.</li>\n    <li>Utilized tools such as Burp Suite, SQLMap, Kali Linux, WPScan, and OWASP ZAP for thorough security analysis.</li>\n    <li>Implemented security enhancements to prevent future attacks and ensure the website's integrity.</li>\n  </ul>\n\n  <p><strong>Technical Details:</strong></p>\n  <ul>\n    <li><strong>Technologies Used:</strong> WordPress, Burp Suite, SQLMap, Kali Linux, WPScan, OWASP ZAP</li>\n    <li><strong>Key Features:</strong> Website restoration, debugging and troubleshooting, penetration testing, security enhancements</li>\n  </ul>\n</div>\n",
    "technologies": [
      "PHP",
      "Apache",
      "Wordpress",
      "OWASP ZAP",
      "WPScan",
      "Kali Linux",
      "sql-map",
      "Burp-suite",
      "HTML",
      "CSS",
      "Bootstrap",
      "MySQL"
    ],
    "deliverables": [
      "Server Administration",
      "Full Stack Develompent",
      "Web Server Configuration and Optimization",
      "API",
      "CMS",
      "Website"
    ],
    "startDate": "2024-06-01",
    "endDate": "2024-06-14",
    "link": "https://kemptonsministry.com/",
    "isUp": true
  },
  {
    "id": 10,
    "gallery": [
      "/assets/img/Est autem eu laudan"
    ],
    "title": "Hacked WordPress Site Restoration, Penetration Testing and Security Enhancement",
    "description": "<div class=\"container mt-5\">\n  <p><strong>Description:</strong></p>\n  <p>Restored and secured a client's website after it was attacked and severely compromised by hackers. Conducted comprehensive debugging and troubleshooting, followed by penetration testing using advanced tools to ensure robust security.</p>\n\n  <p><strong>Responsibilities:</strong></p>\n  <ul>\n    <li>Restored the website from backups and reconstructed lost data.</li>\n    <li>Debugged and troubleshooted issues caused by the hacking incident.</li>\n    <li>Performed extensive penetration testing to identify and fix security vulnerabilities.</li>\n    <li>Utilized tools such as Burp Suite, SQLMap, Kali Linux, WPScan, and OWASP ZAP for thorough security analysis.</li>\n    <li>Implemented security enhancements to prevent future attacks and ensure the website's integrity.</li>\n  </ul>\n\n  <p><strong>Technical Details:</strong></p>\n  <ul>\n    <li><strong>Technologies Used:</strong> WordPress, Burp Suite, SQLMap, Kali Linux, WPScan, OWASP ZAP</li>\n    <li><strong>Key Features:</strong> Website restoration, debugging and troubleshooting, penetration testing, security enhancements</li>\n  </ul>\n</div>\n",
    "technologies": [
      "PHP",
      "Apache",
      "Wordpress",
      "OWASP ZAP",
      "WPScan",
      "Kali Linux",
      "sql-map",
      "Burp-suite",
      "HTML",
      "CSS",
      "Bootstrap",
      "MySQL"
    ],
    "deliverables": [
      "Server Administration",
      "Full Stack Develompent",
      "Web Server Configuration and Optimization",
      "API",
      "CMS",
      "Website"
    ],
    "startDate": "2024-06-01",
    "endDate": "2024-06-14",
    "link": "http://joeysshowillgoon.com/",
    "isUp": true
  },
  {
    "id": 7,
    "gallery": [
      "/assets/img/Screenshot from 2024-08-01 11-51-05.png",
      "/assets/img/Screenshot from 2024-08-01 11-50-38.png"
    ],
    "title": "Hacked WordPress Site Restoration, Penetration Testing and Security Enhancement",
    "description": "<div class=\"container mt-5\">\n  <p><strong>Description:</strong></p>\n  <p>Restored and secured a client's website after it was attacked and severely compromised by hackers. Conducted comprehensive debugging and troubleshooting, followed by penetration testing using advanced tools to ensure robust security.</p>\n\n  <p><strong>Responsibilities:</strong></p>\n  <ul>\n    <li>Restored the website from backups and reconstructed lost data.</li>\n    <li>Debugged and troubleshooted issues caused by the hacking incident.</li>\n    <li>Performed extensive penetration testing to identify and fix security vulnerabilities.</li>\n    <li>Utilized tools such as Burp Suite, SQLMap, Kali Linux, WPScan, and OWASP ZAP for thorough security analysis.</li>\n    <li>Implemented security enhancements to prevent future attacks and ensure the website's integrity.</li>\n  </ul>\n\n  <p><strong>Technical Details:</strong></p>\n  <ul>\n    <li><strong>Technologies Used:</strong> WordPress, Burp Suite, SQLMap, Kali Linux, WPScan, OWASP ZAP</li>\n    <li><strong>Key Features:</strong> Website restoration, debugging and troubleshooting, penetration testing, security enhancements</li>\n  </ul>\n</div>\n",
    "technologies": [
      "PHP",
      "Apache",
      "Wordpress",
      "OWASP ZAP",
      "WPScan",
      "Kali Linux",
      "sql-map",
      "Burp-suite",
      "HTML",
      "CSS",
      "Bootstrap",
      "MySQL"
    ],
    "deliverables": [
      "Server Administration",
      "Full Stack Develompent",
      "Web Server Configuration and Optimization",
      "API",
      "CMS",
      "Website"
    ],
    "startDate": "2024-06-01",
    "endDate": "2024-06-14",
    "link": "https://www.ar235pictures.com/",
    "isUp": true
  },
  {
    "id": 11,
    "gallery": [
      "/assets/img/Screenshot from 2024-08-02 09-45-02.png",
      "/assets/img/Screenshot from 2024-08-02 09-45-48.png",
      "/assets/img/WhatsApp Image 2024-08-02 at 9.36.19 AM.jpeg",
      "/assets/img/WhatsApp Image 2024-08-02 at 9.38.15 AM.jpeg",
      "/assets/img/WhatsApp Image 2024-08-02 at 9.41.06 AM (1).jpeg"
    ],
    "title": "Custom Code Customization for FastHost Hosted Website",
    "description": "<div class=\"container mt-5\">\n  <p><strong>Description:</strong></p>\n  <p>Enhanced a FastHost hosted website by adding custom CSS and JavaScript due to the limitations of the FastHost page builder. Implemented complex features such as removing the cart button, adding a contact button, categorizing products, and customizing the navigation bar to meet the client's needs.</p>\n\n  <p><strong>Responsibilities:</strong></p>\n  <ul>\n    <li>Analyzed the limitations of the FastHost page builder and identified areas requiring custom code.</li>\n    <li>Added custom CSS to style the website according to the client's requirements, including hiding unnecessary page features and manipulating the navbar.</li>\n    <li>Developed complex JavaScript solutions to categorize products dynamically.</li>\n    <li>Replaced the default cart button with a custom contact button to enhance user interaction.</li>\n    <li>Removed permanent navigation links that were not needed, streamlining the user interface.</li>\n    <li>Ensured compatibility and responsiveness across different devices and browsers.</li>\n    <li>Conducted thorough testing to ensure all customizations functioned correctly without breaking the existing site features.</li>\n    <li>Provided ongoing maintenance and support for the custom code implementations.</li>\n  </ul>\n\n  <p><strong>Technical Details:</strong></p>\n  <ul>\n    <li><strong>Technologies Used:</strong> FastHost Page Builder, Custom CSS, JavaScript</li>\n    <li><strong>Key Features:</strong> Custom product categorization, navigation bar customization, button replacement, page element manipulation, cross-browser compatibility</li>\n  </ul>\n</div>",
    "technologies": [
      "CSS",
      "HTML",
      "JavaScript",
      "FastHost"
    ],
    "deliverables": [
      "Full Stack Develompent",
      "Website",
      "CMS",
      "E-commerce",
      "Web Design"
    ],
    "startDate": "2024-04-02",
    "endDate": "2024-04-25",
    "link": "https://www.theluxurygarden.co.uk",
    "isUp": true
  },
  {
    "id": 12,
    "title": " Migrating and Redesigning a GoDaddy Website to WordPress for a Garage Business",
    "description": "<div class=\"container mt-5\">\n  <p><strong>Description:</strong></p>\n  <p>Successfully migrated a client's website from GoDaddy's builder to WordPress, redesigning it to be clean, professional, and modern. Implemented a feature where customers can click on a logo to browse brochures of products from different manufacturers, tailored specifically for a garage business.</p>\n\n  <p><strong>Responsibilities:</strong></p>\n  <ul>\n    <li>Analyzed and planned the migration process from GoDaddy to WordPress, ensuring a smooth transition without data loss.</li>\n    <li>Designed a new, modern, and professional layout for the website, enhancing the user experience.</li>\n    <li>Developed the website using WordPress, incorporating client feedback to match their vision.</li>\n    <li>Implemented a feature allowing customers to click on manufacturer logos to browse brochures and product information.</li>\n    <li>Customized the website's look and feel using CSS and JavaScript to ensure it met the client's brand standards.</li>\n    <li>Ensured the website was responsive and compatible with various devices and browsers.</li>\n    <li>Conducted thorough testing to verify that all features, including the brochure browsing functionality, worked seamlessly.</li>\n    <li>Provided training and support to the client on managing their new WordPress site.</li>\n  </ul>\n\n  <p><strong>Technical Details:</strong></p>\n  <ul>\n    <li><strong>Technologies Used:</strong> WordPress, CSS, JavaScript, GoDaddy</li>\n    <li><strong>Key Features:</strong> Website migration, modern redesign, clickable logos for brochure browsing, responsive design, cross-browser compatibility</li>\n  </ul>\n</div>\n",
    "startDate": "2024-03-15",
    "endDate": "2024-03-14",
    "technologies": [
      "PHP",
      "Wordpress",
      "Apache",
      "JavaScript",
      "HTML",
      "CSS",
      "MySQL"
    ],
    "deliverables": [
      "Full Stack Develompent",
      "Website",
      "Web Design",
      "Server Administration",
      "Application Upgrades and Migration"
    ],
    "gallery": [
      "/assets/img/WhatsApp Image 2024-08-02 at 10.34.35 AM.jpeg",
      "/assets/img/WhatsApp Image 2024-08-02 at 10.34.36 AM.jpeg",
      "/assets/img/WhatsApp Image 2024-08-02 at 10.34.36 AM (1).jpeg",
      "/assets/img/WhatsApp Image 2024-08-02 at 10.34.36 AM (2).jpeg",
      "/assets/img/WhatsApp Image 2024-08-02 at 10.34.37 AM.jpeg",
      "/assets/img/WhatsApp Image 2024-08-02 at 10.34.37 AM (1).jpeg",
      "/assets/img/WhatsApp Image 2024-08-02 at 10.34.38 AM.jpeg"
    ],
    "link": "https://bvpdoors.com/",
    "isUp": true
  },
  {
    "id": 13,
    "gallery": [
      "/assets/img/Screenshot from 2024-08-03 08-31-27.png",
      "/assets/img/WhatsApp Image 2024-08-03 at 8.12.31 AM.jpeg"
    ],
    "title": "Custom Wix Coding, Adding Document Download Feature to Wix Product Pages",
    "description": "<div class=\"container mt-5\">\n  <p><strong>Description:</strong></p>\n  <p>Implemented a custom solution for a Wix website to allow clients to download files for each product, overcoming the default limitations of Wix's product table editing capabilities. Created a new table, \"Products Details,\" with a \"Doc Download\" column where the user can insert product-specific documents for download on the product page frontend.</p>\n\n  <p><strong>Responsibilities:</strong></p>\n  <ul>\n    <li>Analyzed Wix's limitations regarding product table editing and devised a workaround using Wix code.</li>\n    <li>Created a new dataset table, \"Products Details,\" to store document links for each product.</li>\n    <li>Developed a frontend button on product pages that references the product ID and enables document downloads.</li>\n    <li>Utilized Wix's dataset widget to link the \"Doc Download\" column with the corresponding product pages.</li>\n    <li>Wrote custom Wix code to fetch product IDs on page load and display the appropriate download button for each product.</li>\n    <li>Tested the implementation to ensure the document download feature worked seamlessly across all product pages.</li>\n    <li>Provided documentation and support to the client on how to manage the new document download feature.</li>\n  </ul>\n\n  <p><strong>Technical Details:</strong></p>\n  <ul>\n    <li><strong>Technologies Used:</strong> Wix, Wix Code (Velo), JavaScript</li>\n    <li><strong>Key Features:</strong> Custom product table, document download functionality, dynamic product ID referencing, seamless integration with Wix's dataset widget</li>\n  </ul>\n</div>",
    "technologies": [
      "JavaScript",
      "CSS",
      "HTML",
      "Wix"
    ],
    "deliverables": [
      "Web Design",
      "Full Stack Develompent",
      "Website"
    ],
    "startDate": "2024-03-03",
    "endDate": "2024-03-22",
    "link": "",
    "isUp": false
  },
  {
    "id": 14,
    "title": "WordPress Page Builder Plugin Development",
    "description": "\n<div class=\"container mt-5\">\n  <p><strong>Description:</strong></p>\n  <p>Developed a comprehensive WordPress page builder plugin using Vue.js and the GrapeJS library. The plugin features a canvas area for drag-and-drop page building, a sidebar panel with widgets and settings, an inspector panel for element customization, an element library with widgets and blocks, a template library, styling options, responsive design features, and revision history with undo/redo functionality.</p>\n\n  <p><strong>Responsibilities:</strong></p>\n  <ul>\n    <li>Developed a canvas area for drag-and-drop page building within 3 days.</li>\n    <li>Created a sidebar panel with widgets and settings over a period of 5 days.</li>\n    <li>Designed an inspector panel for element customization in 7 days.</li>\n    <li>Built an element library with various widgets and blocks in 8 days.</li>\n    <li>Developed a template library containing page and section templates in 4 days.</li>\n    <li>Implemented styling options for both global and element-specific styles within 2 days.</li>\n    <li>Added responsive design features to ensure compatibility across devices in 1 day.</li>\n    <li>Integrated revision history and undo/redo functionality to enhance user experience.</li>\n  </ul>\n\n  <p><strong>Technical Details:</strong></p>\n  <ul>\n    <li><strong>Technologies Used:</strong> WordPress, Vue.js, GrapeJS</li>\n    <li><strong>Key Features:</strong> \n      <ul>\n        <li>Canvas area for drag-and-drop page building</li>\n        <li>Sidebar panel with widgets and settings</li>\n        <li>Inspector panel for element customization</li>\n        <li>Element library with widgets and blocks</li>\n        <li>Template library with page and section templates</li>\n        <li>Styling options for global and element-specific styles</li>\n        <li>Responsive design features</li>\n        <li>Revision history and undo/redo functionality</li>\n      </ul>\n    </li>\n  </ul>\n</div>",
    "startDate": "2024-01-03",
    "endDate": "2024-02-04",
    "technologies": [
      "Grapejs",
      "JavaScript",
      "HTML",
      "CSS",
      "Bootstrap",
      "MySQL",
      "PHP",
      "Node.js",
      "Wordpress",
      "Apache",
      "Vue.js"
    ],
    "deliverables": [
      "Website",
      "Plugin Development",
      "Wordpress Plugin Development",
      "Web Design",
      "Full Stack Develompent",
      "Web Server Configuration and Optimization"
    ],
    "gallery": [
      "/assets/img/WhatsApp Image 2024-08-03 at 8.51.13 AM.jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 8.51.13 AM (1).jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 8.51.14 AM.jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 8.51.14 AM (1).jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 8.51.14 AM (2).jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 8.51.15 AM.jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 8.51.15 AM (1).jpeg"
    ],
    "link": "https://flexbuilderapp.webwrits.com/",
    "isUp": true
  },
  {
    "id": 15,
    "title": " Laravel + Vuejs Wifi Captive Portal",
    "description": "<div class=\"container mt-5\">\n  <p><strong>Description:</strong></p>\n  <p>Developed a secure and user-friendly captive portal solution for managing WiFi access, integrating payment functionality via the M-Pesa Daraja API. Utilized Laravel for the backend and Vue.js for the frontend to deliver a seamless user experience. The solution includes a subscription feature allowing administrators to manage plans, payments, and subscriptions.</p>\n\n  <p><strong>Responsibilities:</strong></p>\n\n  <p><strong>1. Backend Development:</strong></p>\n  <ul>\n    <li><strong>Framework Selection and Setup:</strong>\n      <ul>\n        <li>Chose Laravel for its robust features and ease of integration with various services.</li>\n        <li>Set up a scalable and secure Laravel backend to handle user authentication, session management, payments, and subscriptions.</li>\n      </ul>\n    </li>\n    <li><strong>Database Design and Management:</strong>\n      <ul>\n        <li>Designed and implemented a relational database schema to store user information, payment records, subscription details, and session data.</li>\n        <li>Ensured data integrity and security through appropriate use of migrations, seeders, and eloquent models.</li>\n      </ul>\n    </li>\n    <li><strong>API Integration:</strong>\n      <ul>\n        <li>Integrated the M-Pesa Daraja API for payment processing, including setting up necessary credentials and handling API requests/responses.</li>\n        <li>Developed secure endpoints to handle payment notifications and updates from M-Pesa.</li>\n      </ul>\n    </li>\n    <li><strong>Subscription Management:</strong>\n      <ul>\n        <li>Implemented subscription features to allow users to select and manage subscription plans.</li>\n        <li>Developed backend functionality for administrators to create, update, and delete subscription plans.</li>\n      </ul>\n    </li>\n  </ul>\n\n  <p><strong>2. Frontend Development:</strong></p>\n  <ul>\n    <li><strong>Framework Selection and Setup:</strong>\n      <ul>\n        <li>Chose Vue.js for its reactive capabilities and ease of integration with the Laravel backend.</li>\n        <li>Set up a responsive and dynamic frontend interface using Vue.js components and Vue Router.</li>\n      </ul>\n    </li>\n    <li><strong>User Interface Design:</strong>\n      <ul>\n        <li>Designed and implemented a user-friendly interface for the captive portal, including registration, login, payment, and subscription management pages.</li>\n        <li>Ensured a seamless user experience across different devices and browsers.</li>\n      </ul>\n    </li>\n    <li><strong>Payment and Subscription Workflow:</strong>\n      <ul>\n        <li>Implemented a step-by-step workflow guiding users from registration to payment and subscription management.</li>\n        <li>Integrated real-time feedback and notifications for payment and subscription status updates.</li>\n      </ul>\n    </li>\n  </ul>\n\n  <p><strong>3. Security and Compliance:</strong></p>\n  <ul>\n    <li><strong>Data Encryption:</strong>\n      <ul>\n        <li>Implemented secure data transmission using HTTPS and ensured sensitive data, such as passwords and payment details, were encrypted.</li>\n        <li>Used Laravel’s built-in security features to protect against common vulnerabilities such as SQL injection, cross-site scripting (XSS), and cross-site request forgery (CSRF).</li>\n      </ul>\n    </li>\n    <li><strong>Session Management:</strong>\n      <ul>\n        <li>Developed secure session management to track user access and ensure only authenticated users can access the network.</li>\n        <li>Implemented session timeouts and re-authentication mechanisms to enhance security.</li>\n      </ul>\n    </li>\n    <li><strong>Regulatory Compliance:</strong>\n      <ul>\n        <li>Ensured compliance with relevant data protection regulations and industry standards, such as PCI DSS, for handling payment information.</li>\n        <li>Maintained transparent communication with users regarding data collection and privacy policies.</li>\n      </ul>\n    </li>\n  </ul>\n\n  <p><strong>4. Testing and Deployment:</strong></p>\n  <ul>\n    <li><strong>Unit and Integration Testing:</strong>\n      <ul>\n        <li>Wrote comprehensive unit and integration tests for both backend and frontend components to ensure functionality and reliability.</li>\n        <li>Conducted extensive testing of the payment and subscription workflows to handle various scenarios and edge cases.</li>\n      </ul>\n    </li>\n    <li><strong>Deployment and Monitoring:</strong>\n      <ul>\n        <li>Deployed the application on a production server, ensuring proper configuration and optimization for performance.</li>\n        <li>Set up monitoring and logging to track system performance and detect any issues promptly.</li>\n      </ul>\n    </li>\n  </ul>\n\n  <p><strong>5. Maintenance and Support:</strong></p>\n  <ul>\n    <li><strong>Bug Fixes and Updates:</strong>\n      <ul>\n        <li>Provided ongoing maintenance and support to address any bugs or issues reported by users.</li>\n        <li>Implemented updates and new features based on user feedback and evolving requirements.</li>\n      </ul>\n    </li>\n    <li><strong>Documentation:</strong>\n      <ul>\n        <li>Created comprehensive documentation for the codebase, API integration, and user guides.</li>\n        <li>Ensured that documentation was kept up-to-date with any changes or new features.</li>\n      </ul>\n    </li>\n  </ul>\n\n  <p><strong>Skills and Tools Used:</strong></p>\n  <ul>\n    <li>Laravel, Vue.js, MySQL</li>\n    <li>HTML, CSS, JavaScript</li>\n    <li>M-Pesa Daraja API</li>\n    <li>Git for version control</li>\n    <li>RESTful API development</li>\n    <li>Security best practices and compliance standards</li>\n  </ul>\n</div>\n",
    "startDate": "2024-01-10",
    "endDate": "2024-01-30",
    "technologies": [
      "PHP",
      "Vue.js",
      "Apache",
      "HTML",
      "CSS",
      "Bootstrap",
      "Laravel"
    ],
    "deliverables": [
      "Full Stack Develompent",
      "Mobile App",
      "Website",
      "Web Design",
      "API Integration",
      "Single Page Application",
      "Progressive Web App",
      "E-commerce",
      "API",
      "CMS",
      "Web Server Configuration and Optimization",
      "Server Security"
    ],
    "gallery": [
      "/assets/img/WhatsApp Image 2024-08-03 at 10.18.58 AM.jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 10.18.59 AM.jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 10.18.59 AM (1).jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 10.18.59 AM (2).jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 10.18.59 AM (3).jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 10.19.00 AM.jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 10.19.00 AM (1).jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 10.19.00 AM (2).jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 10.19.00 AM (3).jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 10.19.00 AM (3).jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 10.19.01 AM.jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 10.19.01 AM (1).jpeg"
    ],
    "link": "",
    "isUp": false
  },
  {
    "id": 16,
    "title": "MS Access to Web Application Conversion with Laravel and Vue.js",
    "description": "<div class=\"container mt-5\">\n  <p><strong>Description:</strong></p>\n  <p>Converted an MS Access database into a web application using Laravel and Vue.js. Migrated the data to a MySQL database and developed a comprehensive Monitoring and Evaluation Management Information System (KeLCoP) with several functional modules for activity planning, progress monitoring, and administrative tasks.</p>\n\n  <p><strong>Responsibilities:</strong></p>\n  <ul>\n    <li><strong>Database Migration:</strong></li>\n    <ul>\n      <li>Migrated MS Access data to a MySQL database, ensuring data integrity and consistency.</li>\n      <li>Designed and implemented a relational database schema to support the web application's functionality.</li>\n    </ul>\n    <li><strong>Application Development:</strong></li>\n    <ul>\n      <li>Developed a web application using Laravel for backend and Vue.js for frontend.</li>\n      <li>Created and integrated modules for:\n        <ul>\n          <li>Activity Planning and Budgeting</li>\n          <li>Progress Monitoring and Reporting</li>\n          <li>Out of Station and Back to Office</li>\n          <li>Administrative Functions</li>\n        </ul>\n      </li>\n    </ul>\n    <li><strong>Module Implementation:</strong></li>\n    <ul>\n      <li>Implemented features for activity planning, financing summaries, and budgeting.</li>\n      <li>Developed progress monitoring tools for reporting and data entry.</li>\n      <li>Created functionalities for managing out-of-station requests and administrative tasks.</li>\n    </ul>\n    <li><strong>User Interface and Experience:</strong></li>\n    <ul>\n      <li>Designed and styled the user interface to ensure a seamless and user-friendly experience.</li>\n      <li>Implemented responsive design to support various devices and screen sizes.</li>\n    </ul>\n    <li><strong>Testing and Deployment:</strong></li>\n    <ul>\n      <li>Conducted thorough testing to ensure all features and functionalities worked as intended.</li>\n      <li>Deployed the application on a production server, optimizing performance and security.</li>\n    </ul>\n  </ul>\n\n  <p><strong>Technical Details:</strong></p>\n  <ul>\n    <li><strong>Technologies Used:</strong> Laravel, Vue.js, MySQL</li>\n    <li><strong>Key Features:</strong> Comprehensive module integration, responsive design, data migration from MS Access to MySQL, user-friendly interface</li>\n  </ul>\n</div>\n",
    "startDate": "2023-08-03",
    "endDate": "2023-09-30",
    "technologies": [
      "PHP",
      "Vue.js",
      "Apache",
      "Composer",
      "Node.js",
      "Laravel",
      "MySQL",
      "JavaScript",
      "MS ACCESS DATABASE",
      "HTML",
      "CSS"
    ],
    "deliverables": [
      "Server Administration",
      "Full Stack Develompent",
      "Web Server Configuration and Optimization",
      "Application Upgrades and Migration",
      "Server Security",
      "Website",
      "CMS",
      "Single Page Application",
      "Progressive Web App",
      "Web Design"
    ],
    "gallery": [
      "/assets/img/WhatsApp Image 2024-08-03 at 10.53.10 AM.jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 10.53.10 AM (1).jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 10.53.11 AM.jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 10.53.11 AM (1).jpeg",
      "/assets/img/WhatsApp Image 2024-08-03 at 10.53.12 AM.jpeg"
    ],
    "link": "https://kelcopmis.kelcop.or.ke/",
    "isUp": true
  }
]