[
  {
    "id": 1,
    "gallery": [
      "/assets/img/Error.jpeg",
      "/assets/img/Screenshot from 2024-07-30 18-50-09.png",
      "/assets/img/Server Logs.png"
    ],
    "title": "WHM Internal Server Error Debugging and Troubleshooting + Laravel Project Upgrade",
    "description": "<div class=\"mt-4\">\n  <!-- Description Section -->\n  <div class=\"mb-4\">\n    <h3>Description:</h3>\n    <p>\n      The client’s web application was down due to an internal server error caused by upgrading PHP from version 8.2 to 8.3. This upgrade led to a wide range of server issues. I addressed and resolved numerous technical challenges involving PHP environment setup, server configurations, and application dependencies. This process required extensive troubleshooting and optimization to ensure seamless and reliable application performance.\n    </p>\n  </div>\n\n  <!-- Responsibilities Section -->\n  <div class=\"mb-4\">\n    <h3>Responsibilities:</h3>\n\n    <!-- PHP Version Issues -->\n    <div class=\"mb-3\">\n      <h5>PHP Version Issues:</h5>\n      <ul>\n        <li>Fixed PHP version discrepancies by ensuring compatibility between different PHP versions used by the server and PHP-FPM.</li>\n        <li>Configured the PHP version for the site, ensuring the correct version was utilized by both the web server and PHP-FPM.</li>\n      </ul>\n    </div>\n\n    <!-- PHP-FPM Service Issues -->\n    <div class=\"mb-3\">\n      <h5>PHP-FPM Service Issues:</h5>\n      <ul>\n        <li>Diagnosed and resolved PHP-FPM service errors, including fixing the issue where PHP-FPM was not restarting correctly.</li>\n        <li>Checked PHP-FPM configurations and ensured the correct socket directories were set up.</li>\n        <li>Verified the systemctl status and restarted PHP-FPM for specific cPanel accounts to ensure smooth operation.</li>\n      </ul>\n    </div>\n\n    <!-- Permission Issues -->\n    <div class=\"mb-3\">\n      <h5>Permission Issues:</h5>\n      <ul>\n        <li>Addressed file and directory permission issues that were causing \"Forbidden\" (403) errors.</li>\n        <li>Ensured the .htaccess file and directories were readable and executable.</li>\n        <li>Configured the .htaccess file and web server settings to resolve permission-related errors.</li>\n      </ul>\n    </div>\n\n    <!-- Server Configuration -->\n    <div class=\"mb-3\">\n      <h5>Server Configuration:</h5>\n      <ul>\n        <li>Adjusted web server configurations to ensure proper handling of requests and to avoid \"Internal Server Error\" (500) and \"Service Unavailable\" (503) errors.</li>\n        <li>Configured ModSecurity rules, firewall, and security settings to prevent unauthorized access while allowing necessary operations.</li>\n      </ul>\n    </div>\n\n    <!-- Composer Dependency Issues -->\n    <div class=\"mb-3\">\n      <h5>Composer Dependency Issues:</h5>\n      <ul>\n        <li>Managed and resolved Composer dependency conflicts by installing and configuring required packages and extensions.</li>\n        <li>Ensured all necessary PHP extensions such as iconv, mbstring, zip, curl, sodium, fileinfo, bcmath, and gd were enabled and correctly configured.</li>\n      </ul>\n    </div>\n\n    <!-- Laravel Upgrade -->\n    <div class=\"mb-3\">\n      <h5>Laravel Upgrade:</h5>\n      <ul>\n        <li>Upgraded Laravel to use PHP 8.3, ensuring compatibility and improved performance.</li>\n        <li>Performed thorough testing and debugging to ensure the application ran smoothly on the upgraded environment.</li>\n      </ul>\n    </div>\n\n    <!-- Error Resolution -->\n    <div class=\"mb-3\">\n      <h5>Error Resolution:</h5>\n      <ul>\n        <li>Fixed various HTTP errors including 403 (Forbidden) and 503 (Service Unavailable).</li>\n        <li>Diagnosed and resolved internal server errors (500), ensuring proper server configuration and application functionality.</li>\n      </ul>\n    </div>\n  </div>\n</div>",
    "technologies": [
      "PHP",
      "Apache",
      "Composer",
      "Laravel"
    ],
    "deliverables": [
      "Server Administration",
      "Full Stack Develompent",
      "Web Server Configuration and Optimization",
      "Application Upgrades and Migration",
      "Server Security",
      "Website"
    ],
    "startDate": "2024-07-10",
    "endDate": "2024-07-30",
    "link": "https://blengi.com"
  },
  {
    "id": 2,
    "gallery": [
      "/assets/img/6c87de9f-464f-4e85-a1f9-b10bef03b296.jpeg",
      "/assets/img/690fcbb5-c49c-4a50-88bb-d8bb07566ff3.jpeg",
      "/assets/img/a50baf44-d55d-4830-b2d2-84074a02d057.jpeg"
    ],
    "title": "Debugging and Troubleshooting 503 Downtime Issues in WordPress",
    "description": "<div class=\"container mt-5\">\n    <p><strong>Description</strong></p>\n    <p>\n        Addressed and resolved persistent 503 Service Unavailable errors affecting a WordPress site, ensuring improved uptime and reliability. Conducted thorough debugging to identify the root causes of downtime, including server overload, plugin conflicts, and cron job issues. Implemented effective troubleshooting strategies to optimize server performance and mitigate future downtime.\n    </p>\n\n    <p><strong>Responsibilities</strong></p>\n    <ul>\n        <li><strong>Issue Diagnosis:</strong> Conducted in-depth analysis to identify the causes of 503 errors, including server load, plugin conflicts, and misconfigurations.</li>\n        <li><strong>Troubleshooting Plan:</strong> Developed and executed a comprehensive troubleshooting plan to address and resolve identified issues.</li>\n        <li><strong>Server Optimization:</strong> Implemented server and resource optimizations to handle high traffic and prevent future downtime.</li>\n        <li><strong>Plugin and Theme Review:</strong> Analyzed and updated plugins and themes to ensure compatibility and performance.</li>\n        <li><strong>Error Log Analysis:</strong> Reviewed and interpreted server and error logs to pinpoint issues and verify fixes.</li>\n        <li><strong>Monitoring Setup:</strong> Configured and fine-tuned monitoring tools to track site health and receive timely alerts for potential issues.</li>\n        <li><strong>Performance Improvements:</strong> Enhanced overall site performance through caching, database optimization, and server configuration.</li>\n    </ul>\n    \n</div>",
    "technologies": [
      "PHP",
      "Wordpress",
      "UptimeRobot",
      "Apache"
    ],
    "deliverables": [
      "Server Administration",
      "Full Stack Develompent",
      "Website",
      "CMS"
    ],
    "startDate": "2024-07-01",
    "endDate": "2024-07-06",
    "link": "https://xpfrance.net"
  },
  {
    "id": 3,
    "gallery": [
      "/assets/img/776d17c3-3a53-48d3-a3bf-59603faf668a.jpeg",
      "/assets/img/2a90fb3e-35c7-45e5-b97e-55bd06a8b90f.jpeg",
      "/assets/img/aa0d3223-935e-4047-8fed-d204e0667ce0.jpeg"
    ],
    "title": "Debugging and Troubleshooting Stripe Payment Issues in WordPress Tour Master Plugin",
    "description": "<div class=\"mt-5\">\n  <p><strong>Description:</strong></p>\n  <p>Resolved critical payment issues within the WordPress Tour Master Plugin involving Stripe credit card transactions. The problem was identified during the booking process for tours, where several PHP notices and fatal errors were logged, indicating issues with undefined indices and type errors in Stripe API integration.</p>\n\n  <p><strong>Responsibilities:</strong></p>\n  <ul>\n    <li>Analyzed and identified the root cause of the payment processing errors in the WordPress Tour Master Plugin.</li>\n    <li>Diagnosed PHP notices related to undefined indices for <code>tour-date</code> and <code>tour-dinner-option</code> and resolved them.</li>\n    <li>Addressed fatal errors linked to the Stripe API, including type mismatches and incorrect handling of API responses.</li>\n    <li>Debugged and corrected issues in the plugin's Stripe integration code, focusing on proper data handling and API request formatting.</li>\n    <li>Tested and verified the solution to ensure successful completion of tour bookings with Stripe payments.</li>\n    <li>Provided recommendations for future improvements to prevent similar issues.</li>\n  </ul>\n\n  <p><strong>Technical Details:</strong></p>\n  <ul>\n    <li><strong>Errors Encountered:</strong> Undefined index warnings, <code>TypeError</code> in Stripe API calls.</li>\n    <li><strong>Error Logs:</strong> Detailed log entries indicated problems with <code>tour-date</code>, <code>tour-dinner-option</code>, and <code>Stripe\\Util\\CaseInsensitiveArray::offsetGet()</code>.</li>\n  </ul>\n</div>\n",
    "technologies": [
      "PHP",
      "Apache",
      "Wordpress",
      "Stripe"
    ],
    "deliverables": [
      "Full Stack Develompent",
      "Website",
      "API",
      "API Integration",
      "Wordpress Plugin Development",
      "Plugin Development",
      "CMS"
    ],
    "startDate": "2024-07-01",
    "endDate": "2024-07-11",
    "link": "https://vagabondmoto.com.au"
  }
]